dashboard/tests/load/room3-example.yml
config:
  target: "ws://127.0.0.1:8000/ws/chat/3/"
  phases:
    - duration: 10
      arrivalRate: 5
  engines:
    ws:
      headers:
        Origin: "http://127.0.0.1:8000"
        Cookie: "sessionid=89q6gaojtuqkr967otrx75m158gxuitf"   # ExampleUser
scenarios:
  - name: example
    engine: ws
    flow:
      - send: { type: "message", message: "ex hi {{ $randomString() }}", message_client_id: "{{ $uuid }}" }
      - receive: {}
      - loop:
          - send: { type: "typing", is_typing: true }
          - think: 0.2
          - send: { type: "typing", is_typing: false }
          - send: { type: "message", message: "ex ping {{ $randomNumber(1,1000) }}", message_client_id: "{{ $uuid }}" }
          - receive: {}
          - think: 0.5
        count: 5